# üõí E-Commerce Transaction Analysis Practice

This notebook contains **12 practice questions** focused on analyzing e-commerce transactions and backtracking transaction data.

## Instructions
1. First, run the database setup cell to create the database
2. Solve each question by writing SQL queries or Python code
3. Check your answers against the provided solutions

---

## üì¶ Setup: Create and Connect to Database

In [2]:
# Run the database setup script first
%run ecommerce_db_setup.py

üõí E-COMMERCE DATABASE SETUP
----------------------------------------
‚úì Tables created successfully!

OperationalError: database is locked

In [3]:
# Import necessary libraries
import sqlite3
import pandas as pd

# Connect to the database
conn = sqlite3.connect('ecommerce.db')

# Helper function to run queries
def run_query(query):
    """Execute a SQL query and return results as a DataFrame"""
    return pd.read_sql_query(query, conn)

print("‚úì Connected to ecommerce.db successfully!")

‚úì Connected to ecommerce.db successfully!

## üìä Database Schema Overview

| Table | Description |
|-------|-------------|
| `customers` | Customer information (id, name, email, address, etc.) |
| `categories` | Product categories |
| `products` | Product catalog with prices and stock |
| `orders` | Order information with status (pending, shipped, completed, refunded, cancelled) |
| `order_items` | Individual items in each order |
| `payments` | Payment records for orders |
| `refunds` | Refund records for returned/refunded orders |

In [4]:
# Preview Tables
print("=" * 60)
print("CUSTOMERS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM customers LIMIT 5"))

print("\n" + "=" * 60)
print("PRODUCTS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM products LIMIT 5"))

print("\n" + "=" * 60)
print("ORDERS TABLE")
print("=" * 60)
display(run_query("SELECT * FROM orders LIMIT 5"))

============================================================
CUSTOMERS TABLE
============================================================

,customer_id,first_name,last_name,email,phone,address,city,country,registration_date
0,1,John,Smith,john.smith@email.com,555-0101,123 Main St,New York,USA,2023-01-15
1,2,Emily,Johnson,emily.j@email.com,555-0102,456 Oak Ave,Los Angeles,USA,2023-02-20
2,3,Michael,Williams,mwilliams@email.com,555-0103,789 Pine Rd,Chicago,USA,2023-03-10
3,4,Sarah,Brown,sarah.b@email.com,555-0104,321 Elm St,Houston,USA,2023-04-05
4,5,David,Jones,djones@email.com,555-0105,654 Maple Dr,Phoenix,USA,2023-05-12

============================================================
PRODUCTS TABLE
============================================================

,product_id,product_name,category_id,price,stock_quantity,description
0,1,iPhone 15 Pro,1,999.99,50,Latest Apple smartphone
1,2,Samsung Galaxy S24,1,899.99,45,Premium Android phone
2,3,MacBook Air M3,1,1299.99,30,Apple laptop with M3 chip
3,4,AirPods Pro 2,1,249.99,100,Wireless earbuds
4,5,Nike Air Max,2,129.99,80,Running shoes

============================================================
ORDERS TABLE
============================================================

,order_id,customer_id,order_date,status,shipping_address,total_amount
0,1,1,2024-01-05 10:30:00,completed,"123 Main St, New York",1249.98
1,2,2,2024-01-07 14:15:00,completed,"456 Oak Ave, Los Angeles",899.99
2,3,3,2024-01-10 09:45:00,completed,"789 Pine Rd, Chicago",179.98
3,4,1,2024-01-12 16:20:00,completed,"123 Main St, New York",249.99
4,5,4,2024-01-15 11:00:00,shipped,"321 Elm St, Houston",1549.98

---

# üìù Practice Questions

---

## Question 1: Basic Transaction Lookup

**Find all orders placed by customer with ID 1, including the order date and total amount.**

Expected: List all orders for customer_id = 1

In [5]:
# YOUR CODE HERE
run_query("""SELECT * 

FROM orders

WHERE customer_id = 1
ORDER BY order_date DESC
""")

,order_id,customer_id,order_date,status,shipping_address,total_amount
0,18,1,2024-02-18 09:45:00,pending,"123 Main St, New York",149.99
1,4,1,2024-01-12 16:20:00,completed,"123 Main St, New York",249.99
2,1,1,2024-01-05 10:30:00,completed,"123 Main St, New York",1249.98

In [6]:
# SOLUTION
query = """
SELECT order_id, order_date, status, total_amount
FROM orders
WHERE customer_id = 1
ORDER BY order_date;
"""
run_query(query)

   order_id           order_date     status  total_amount
0         1  2024-01-05 10:30:00  completed       1249.98
1         4  2024-01-12 16:20:00  completed        249.99
2        18  2024-02-18 09:45:00    pending        149.99

---

## Question 2: Transaction Details Backtracking

**For order ID 1, backtrack and find all the items purchased, including product names and quantities.**

This requires joining `order_items` with `products` table.

In [9]:
# YOUR CODE HERE
run_query(
    """
    SELECT * 
    FROM orders o
    JOIN products p
        ON p.product_id = o.product_id
    """
)

DatabaseError: Execution failed on sql '
    SELECT *
    FROM orders o
    JOIN products p
        ON p.product_id = o.product_id
    ': no such column: o.product_id

---

## Question 3: Identify Refunded Transactions

**Find all orders that have been refunded, including the customer name, order date, and refund details.**

Use JOIN to connect orders, customers, and refunds tables.

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    o.order_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    o.order_date,
    o.total_amount AS original_amount,
    r.refund_date,
    r.refund_amount,
    r.reason
FROM refunds r
JOIN orders o ON r.order_id = o.order_id
JOIN customers c ON o.customer_id = c.customer_id
ORDER BY r.refund_date;
"""
run_query(query)

---

## Question 4: Customer Transaction History

**Create a complete transaction history for customer "Emily Johnson" (customer_id = 2), showing all orders with their items.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    c.first_name || ' ' || c.last_name AS customer_name,
    o.order_id,
    o.order_date,
    o.status,
    p.product_name,
    oi.quantity,
    oi.subtotal
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
JOIN order_items oi ON o.order_id = oi.order_id
JOIN products p ON oi.product_id = p.product_id
WHERE c.customer_id = 2
ORDER BY o.order_date, o.order_id;
"""
run_query(query)

---

## Question 5: Payment Method Analysis

**Analyze transactions by payment method. Show the total revenue and number of transactions for each payment method.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    payment_method,
    COUNT(*) AS transaction_count,
    SUM(amount) AS total_revenue,
    ROUND(AVG(amount), 2) AS avg_transaction
FROM payments
WHERE status = 'completed'
GROUP BY payment_method
ORDER BY total_revenue DESC;
"""
run_query(query)

---

## Question 6: Cancelled Orders Analysis

**Find all cancelled orders and calculate the total revenue lost from cancellations. Include what products were in those orders.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    o.order_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    o.order_date,
    p.product_name,
    oi.quantity,
    oi.subtotal,
    o.total_amount AS order_total
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
JOIN order_items oi ON o.order_id = oi.order_id
JOIN products p ON oi.product_id = p.product_id
WHERE o.status = 'cancelled';
"""
print("Cancelled Orders Details:")
display(run_query(query))

# Total lost revenue
query2 = """
SELECT 
    COUNT(DISTINCT order_id) AS cancelled_orders,
    SUM(total_amount) AS total_lost_revenue
FROM orders
WHERE status = 'cancelled';
"""
print("\nTotal Revenue Lost:")
display(run_query(query2))

---

## Question 7: Top Spending Customers

**Find the top 5 customers by total spending (completed orders only). Include their email and total orders count.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    c.customer_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    c.email,
    COUNT(o.order_id) AS total_orders,
    SUM(o.total_amount) AS total_spent
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
WHERE o.status = 'completed'
GROUP BY c.customer_id
ORDER BY total_spent DESC
LIMIT 5;
"""
run_query(query)

---

## Question 8: Product Sales Tracking

**Find the best-selling products by quantity sold. Include the category name and total revenue generated by each product.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    p.product_name,
    cat.category_name,
    SUM(oi.quantity) AS total_quantity_sold,
    SUM(oi.subtotal) AS total_revenue
FROM products p
JOIN categories cat ON p.category_id = cat.category_id
JOIN order_items oi ON p.product_id = oi.product_id
JOIN orders o ON oi.order_id = o.order_id
WHERE o.status NOT IN ('cancelled')
GROUP BY p.product_id
ORDER BY total_quantity_sold DESC;
"""
run_query(query)

---

## Question 9: Order Status Summary

**Create a summary showing the count and total value of orders for each status (pending, shipped, completed, refunded, cancelled).**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    status,
    COUNT(*) AS order_count,
    SUM(total_amount) AS total_value,
    ROUND(AVG(total_amount), 2) AS avg_order_value
FROM orders
GROUP BY status
ORDER BY order_count DESC;
"""
run_query(query)

---

## Question 10: Monthly Revenue Trend

**Analyze the monthly revenue trend. Group completed orders by month and show the revenue progression.**

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    strftime('%Y-%m', order_date) AS month,
    COUNT(*) AS order_count,
    SUM(total_amount) AS monthly_revenue,
    ROUND(AVG(total_amount), 2) AS avg_order_value
FROM orders
WHERE status = 'completed'
GROUP BY strftime('%Y-%m', order_date)
ORDER BY month;
"""
run_query(query)

---

## Question 11: Full Transaction Backtrack

**For a complete audit, create a query that shows the full lifecycle of order ID 7 (a refunded order):**
- Customer info
- Order details
- Items purchased
- Payment info
- Refund info

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
# Part 1: Order and Customer Info
query1 = """
SELECT 
    o.order_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    c.email,
    o.order_date,
    o.status,
    o.total_amount,
    o.shipping_address
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
WHERE o.order_id = 7;
"""
print("üì¶ ORDER INFO:")
display(run_query(query1))

# Part 2: Items in the order
query2 = """
SELECT 
    p.product_name,
    oi.quantity,
    oi.unit_price,
    oi.subtotal
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
WHERE oi.order_id = 7;
"""
print("\nüõçÔ∏è ORDER ITEMS:")
display(run_query(query2))

# Part 3: Payment info
query3 = """
SELECT 
    payment_id,
    payment_date,
    amount,
    payment_method,
    status
FROM payments
WHERE order_id = 7;
"""
print("\nüí≥ PAYMENT INFO:")
display(run_query(query3))

# Part 4: Refund info
query4 = """
SELECT 
    refund_id,
    refund_date,
    refund_amount,
    reason,
    status
FROM refunds
WHERE order_id = 7;
"""
print("\nüîô REFUND INFO:")
display(run_query(query4))

---

## Question 12: Category Performance Analysis

**Analyze the performance of each product category:**
- Total products sold
- Total revenue
- Number of orders
- Average order value per category
- Refund rate (percentage of refunded orders)

In [ ]:
# YOUR CODE HERE

In [ ]:
# SOLUTION
query = """
SELECT 
    cat.category_name,
    COUNT(DISTINCT o.order_id) AS total_orders,
    SUM(oi.quantity) AS total_items_sold,
    ROUND(SUM(oi.subtotal), 2) AS total_revenue,
    ROUND(AVG(oi.subtotal), 2) AS avg_item_value,
    SUM(CASE WHEN o.status = 'refunded' THEN 1 ELSE 0 END) AS refunded_orders,
    ROUND(
        SUM(CASE WHEN o.status = 'refunded' THEN 1.0 ELSE 0 END) / COUNT(DISTINCT o.order_id) * 100, 
        2
    ) AS refund_rate_percent
FROM categories cat
JOIN products p ON cat.category_id = p.category_id
JOIN order_items oi ON p.product_id = oi.product_id
JOIN orders o ON oi.order_id = o.order_id
GROUP BY cat.category_id
ORDER BY total_revenue DESC;
"""
run_query(query)

---

# üéØ Bonus Challenge

Create your own query to:
1. Find customers who have never made a purchase
2. Identify products that have never been sold
3. Calculate the customer lifetime value (CLV)

In [ ]:
# BONUS: Customers who never made a purchase
query = """
SELECT 
    c.customer_id,
    c.first_name || ' ' || c.last_name AS customer_name,
    c.email,
    c.registration_date
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
WHERE o.order_id IS NULL;
"""
print("Customers with no purchases:")
display(run_query(query))

In [ ]:
# BONUS: Products never sold
query = """
SELECT 
    p.product_id,
    p.product_name,
    cat.category_name,
    p.price,
    p.stock_quantity
FROM products p
JOIN categories cat ON p.category_id = cat.category_id
LEFT JOIN order_items oi ON p.product_id = oi.product_id
WHERE oi.item_id IS NULL;
"""
print("Products never sold:")
display(run_query(query))

In [ ]:
# Close the connection when done
conn.close()
print("Database connection closed.")

---

## üìö Summary

In this practice notebook, you learned how to:

1. **Basic Lookups** - Query orders by customer
2. **Transaction Backtracking** - Trace order items from orders
3. **Refund Analysis** - Track refunded transactions
4. **Customer History** - Complete transaction history
5. **Payment Analysis** - Group by payment methods
6. **Cancelled Orders** - Revenue loss analysis
7. **Top Customers** - Customer spending analysis
8. **Product Performance** - Sales tracking
9. **Order Status** - Status summary reports
10. **Trend Analysis** - Monthly revenue trends
11. **Full Audit Trail** - Complete transaction lifecycle
12. **Category Analysis** - Performance by category

These skills are essential for:
- E-commerce analytics
- Transaction auditing
- Customer behavior analysis
- Financial reporting